import { describe, expect, test } from 'bun:test';
import { bengaliNumInWords } from './bn';

describe.todo('ইন্দোনেশিয়ান', () => {
  describe('একক সংখ্যা', () => {
    test.each<readonly [number, string]>([
      [0, 'শূন্য'],
      [1, 'এক'],
      [2, 'দুই'],
      [3, 'তিন'],
      [4, 'চার'],
      [5, 'পাঁচ'],
      [6, 'ছয়'],
      [7, 'সাত'],
      [8, 'আট'],
      [9, 'নয়'],
    ])('%i দিয়ে %s দেয়', (num, expected) => {
      expect(bengaliNumInWords(num)).toBe(expected);
    });
  });

  describe('দ্বিতীয় সংখ্যা', () => {
    test.each<readonly [number, string]>([
      [10, 'দশ'],
      [11, 'এগারো'],
      [12, 'বারো'],
      [21, 'একুশ'],
      [99, 'নিরাশি'],
    ])('%i দিয়ে %s দেয়', (num, expected) => {
      expect(bengaliNumInWords(num)).toBe(expected);
    });
  });

  describe('ত্রয়ীক সংখ্যা', () => {
    test.each<readonly [number, string]>([
      [100, 'একশো'],
      [101, 'একশো এক'],
      [111, 'একশো এগারো'],
      [321, 'তিনশো একুশ'],
      [999, 'নয়শো নিরাশি'],
    ])('%i দিয়ে %s দেয়', (num, expected) => {
      expect(bengaliNumInWords(num)).toBe(expected);
    });
  });

  describe('হাজার', () => {
    test.each<readonly [number, string]>([
      [1000, 'এক হাজার'],
      [1001, 'এক হাজার এক'],
      [2001, 'দুই হাজার এক'],
      [4321, 'চার হাজার তিনশো একুশ'],
      [9999, 'নয় হাজার নয়শো নিরাশি'],
    ])('%i দিয়ে %s দেয়', (num, expected) => {
      expect(bengaliNumInWords(num)).toBe(expected);
    });
  });

  describe('মিলিয়ন', () => {
    test.each<readonly [number, string]>([
      [1000000, 'এক মিলিয়ন'],
      [2000001, 'দুই মিলিয়ন এক'],
      [1234567, 'এক মিলিয়ন তিনশো চুরাশি হাজার পাঁচ শো ছয় দশ'],
      [7654321, 'সাত মিলিয়ন ছয় শো চুরাশি হাজার চার শো একুশ'],
      [9999999, 'নয় মিলিয়ন নয়শো নিরাশি হাজার নয়শো নিরাশি'],
    ])('%i দিয়ে %s দেয়', (num, expected) => {
      expect(bengaliNumInWords(num)).toBe(expected);
    });
  });

  describe('বিলিয়ন', () => {
    test.each<readonly [number, string]>([
      [1000000000, 'এক বিলিয়ন'],
      [2000000001, 'দুই বিলিয়ন এক'],
      [
        1234567890,
        'এক বিলিয়ন তিনশো চুরাশি মিলিয়ন পাঁচ শো ছয় দশ হাজার আট শো নিরাশি',
      ],
      [
        9876543210,
        'নয় বিলিয়ন আট শো সাত ছয় মিলিয়ন চুরাশি হাজার তিনশো দুই দশ',
      ],
      [
        9999999999,
        'নয় বিলিয়ন নয়শো নিরাশি মিলিয়ন নয়শো নিরাশি হাজার নয়শো নিরাশি',
      ],
    ])('%i দিয়ে %s দেয়', (num, expected) => {
      expect(bengaliNumInWords(num)).toBe(expected);
    });
  });

  describe('ট্রিলিয়ন', () => {
    test.each<readonly [number, string]>([
      [1000000000000, 'এক ট্রিলিয়ন'],
      [2000000000001, 'দুই ট্রিলিয়ন এক'],
      [
        1234567890123,
        'এক ট্রিলিয়ন তিনশো চুরাশি বিলিয়ন পাঁচ শো ছয় দশ মিলিয়ন আট শো নিরাশি হাজার দুই শো তিন',
      ],
      [
        9876543210987,
        'নয় ট্রিলিয়ন আট শো সাত ছয় বিলিয়ন চুরাশি হাজার তিনশো দুই দশ কোটি আট শো সাত',
      ],
      [
        9999999999999,
        'নয় ট্রিলিয়ন নয়শো নিরাশি বিলিয়ন নয়শো নিরাশি মিলিয়ন নয়শো নিরাশি হাজার নয়শো নিরাশি কোটি নয়শো নিরাশি',
      ],
    ])('%i দিয়ে %s দেয়', (num, expected) => {
      expect(bengaliNumInWords(num)).toBe(expected);
    });
  });
});
